In [3]:
import pandas as pd
col_names=['sl_no','age','gender','role','id']
data=pd.read_table("../files/ex.txt",sep="|",names=col_names)#not sure ahy header=0 is used

In [4]:
data.head()

   sl_no   age gender        role     id
0      1  24.0      M  technician  85711
1      2   NaN      F       other  94043
2      3   NaN      M      writer  32067
3      4  24.0      M  technician  43537
4      5  33.0      F       other  15213

In [7]:
data[data.age>25].mean()

            sl_no         age
count  943.000000  941.000000
mean   472.000000   34.043571
std    272.364951   12.184714
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [8]:
data[(data.age>25) & (data.gender=='F')]#and,or will not work use &,|

     sl_no   age gender           role     id
4        5  33.0      F          other  15213
10      11  39.0      F          other  30329
11      12  28.0      F          other  06405
14      15  49.0      F       educator  97301
17      18  35.0      F          other  37212
..     ...   ...    ...            ...    ...
921    922  29.0      F  administrator  21114
929    930  28.0      F      scientist  07310
937    938  38.0      F     technician  55038
938    939  26.0      F        student  33319
941    942  48.0      F      librarian  78209

[196 rows x 5 columns]

In [5]:
(data.dtypes)

sl_no       int64
age       float64
gender     object
role       object
id         object
dtype: object

In [6]:
(data.age>25) & (data.role=='other')

0      False
1      False
2      False
3      False
4       True
       ...
938    False
939    False
940    False
941    False
942    False
Length: 943, dtype: bool

In [7]:
data.dtypes

sl_no       int64
age       float64
gender     object
role       object
id         object
dtype: object

In [8]:
data[data.role.isin(['oters','artist','administrator'])]

     sl_no   age gender           role     id
6        7  57.0      M  administrator  91344
7        8  36.0      M  administrator  05201
22      23  30.0      F         artist  48197
23      24  21.0      F         artist  94533
30      31  24.0      M         artist  10003
..     ...   ...    ...            ...    ...
890    891  51.0      F  administrator  03062
901    902  45.0      F         artist  97203
919    920  30.0      F         artist  90008
921    922  29.0      F  administrator  21114
939    940  32.0      M  administrator  02215

[107 rows x 5 columns]

In [9]:
data[(data.role.isin(['oters','artist','administrator'])) & (data.gender=='M')]

     sl_no   age gender           role     id
6        7  57.0      M  administrator  91344
7        8  36.0      M  administrator  05201
30      31  24.0      M         artist  10003
41      42  30.0      M  administrator  17870
47      48  45.0      M  administrator  12550
77      78  26.0      M  administrator  61801
85      86  26.0      M  administrator  46005
86      87  47.0      M  administrator  89503
94      95  31.0      M  administrator  10707
96      97  43.0      M         artist  98006
117    118  21.0      M  administrator  90210
145    146  45.0      M         artist  83814
161    162  25.0      M         artist  15610
162    163  49.0      M  administrator  97212
188    189  32.0      M         artist  95014
189    190  30.0      M  administrator  95938
190    191  33.0      M  administrator  95161
193    194  38.0      M  administrator  02154
217    218  37.0      M  administrator  06513
236    237  49.0      M  administrator  63146
238    239  39.0      M         artist  95628
260    261  28.0      M  administrator  85202
281    282  22.0      M  administrator  20057
316    317  22.0      M  administrator  13210
325    326  41.0      M  administrator  15235
327    328  51.0      M  administrator  06779
380    381  33.0      M         artist  94608
382    383  42.0      M  administrator  75204
393    394  25.0      M  administrator  96819
408    409  48.0      M  administrator  98225
432    433  27.0      M         artist  11211
446    447  30.0      M  administrator  55113
451    452  35.0      M  administrator  28018
454    455  48.0      M  administrator  83709
499    500  28.0      M  administrator  94305
508    509  23.0      M  administrator  10011
512    513  43.0      M  administrator  26241
570    571  34.0      M         artist  01945
577    578  31.0      M  administrator  M7A1A
595    596  20.0      M         artist  77073
664    665  25.0      M  administrator  55412
665    666  44.0      M  administrator  61820
747    748  28.0      M  administrator  94720
749    750  28.0      M  administrator  32303
761    762  32.0      M  administrator  95050
767    768  29.0      M  administrator  12866
783    784  47.0      M  administrator  91040
787    788  51.0      M  administrator  05779
801    802  35.0      M  administrator  34105
802    803  70.0      M  administrator  78212
818    819  59.0      M  administrator  40205
822    823  27.0      M         artist  50322
825    826  28.0      M         artist  77048
835    836  44.0      M         artist  10018
839    840  39.0      M         artist  55406
851    852  46.0      M  administrator  94086
864    865  25.0      M         artist  11231
939    940  32.0      M  administrator  02215